____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
sequence_layer_warrant0_input (In(None, 100)           0                                            
____________________________________________________________________________________________________
sequence_layer_warrant1_input (In(None, 100)           0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 100, 300)      2037900     sequence_layer_warrant0_input[0][
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 100, 300)      2037900     sequence_layer_warrant1_input[0][
____________________________________________________________________________________________________
BiDiLSTM W0 (Bidirectional)      (None, 100, 128)      186880      embedding_1[0][0]                
____________________________________________________________________________________________________
BiDiLSTM W1 (Bidirectional)      (None, 100, 128)      186880      embedding_2[0][0]                
____________________________________________________________________________________________________
attentionlstm_1 (AttentionLSTM)  (None, 64)            90560       BiDiLSTM W0[0][0]                
____________________________________________________________________________________________________
attentionlstm_2 (AttentionLSTM)  (None, 64)            90560       BiDiLSTM W1[0][0]                
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 64)            0           attentionlstm_1[0][0]            
                                                                   attentionlstm_2[0][0]            
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 64)            0           merge_3[0][0]                    
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 32)            2080        dropout_1[0][0]                  
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 1)             33          dense_1[0][0]                    
====================================================================================================
Total params: 4632793
____________________________________________________________________________________________________
